app/views/stories/show.html.erb

SELECT "votes".* FROM "votes" WHERE ("votes".story_id = 4)
SELECT COUNT(*) FROM "votes" WHERE ("votes".story_id = 4)
---
	<span id="vote_score">
		Score: <%= @story.votes.size %>