app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."login" = 'jimmy' AND "users"."password" = 'aldkfsdl' LIMIT 1
---
  def create
    @current_user = User.find_by_login_and_password(
      params[:login], params[:password])