app/controllers/stories_controller.rb

INSERT INTO "stories" ("user_id", "created_at", "link", "updated_at", "name") VALUES (NULL, '2011-09-25 19:38:50.907334', 'www.liverpoolfc.tv', '2011-09-25 19:38:50.907334', 'official LFC')
---
  def create
    @story = @current_user.stories.build params[:story]
    if @story.save