app/controllers/votes_controller.rb

SELECT "stories".* FROM "stories" WHERE "stories"."id" = 4 LIMIT 1
INSERT INTO "votes" ("user_id", "story_id", "updated_at", "created_at") VALUES (NULL, 6, '2011-09-25 19:39:07.376698', '2011-09-25 19:39:07.376698')
---
  def create
    @story = Story.find(params[:story_id])
    @story.votes.create